"\n\nA young man, struggling with poverty and mental instability, avoids his landlady and wanders through the crowded and chaotic streets of Petersburg. He visits an old woman to pawn a watch, but becomes distracted by a key she carries. He then visits a tavern and meets a drunk man named Marmeladov, who shares his struggles with poverty and alcoholism. The speaker questions the societal norms and restrictions imposed by science and political economy.\n\nThe passage follows the story of a man named Marmeladov and his family, who are struggling with poverty and alcoholism. Marmeladov's wife, Katerina Ivanovna, is ill and their daughter, Sonia, is trying to help them. The narrator reflects on their past struggles and the forgiveness offered by God. They also encounter a drunken man, Marmeladov, who is afraid of his wife and their chaotic home. The scene is set in a small, messy kitchen with a family gathered around a table.\n\nThe story follows Raskolnikov, a man living in a rundown room, as he observes a chaotic scene in a poor family's home. He reflects on his own desires and the negative perceptions of humanity. Later, he receives a letter from his mother and learns about his sister's difficult situation. The family is in debt and Dounia is being mistreated by a man named Svidrigaïlov. However, the truth is revealed and Dounia's reputation is restored. She agrees to marry a man named Pyotr Petrovitch, despite some concerns. The story also explores the themes of first impressions and prejudices.\n\nA man named Pyotr Petrovitch offers a job and is in a hurry to get to Petersburg. He is well-off and has two government positions. His sister, Dounia, is determined and passionate, and is marrying a caring and prudent man. Dounia hopes to work for Pyotr and has plans for her brother to join the business. The narrator is independent and planning to move to Petersburg for a wedding. Dounia is excited to see the narrator and jokes about marrying someone else. The narrator's mother urges him to cherish Dounia and remember their happy childhood. The protagonist is restless and goes for a walk, feeling bitter about his mother's letter and his sister's marriage. The speaker questions the honesty and motives of Dounia's fiancé, Mr. Luzhin. The author is disappointed in Dounia for not seeing through Mr. Luzhin's facade. The speaker reflects on the sacrifices Dounia and Sonia are making for their family. Svidrigaïlovs is contemplating the future of his family and is tortured by these thoughts. The protagonist realizes he must make a decision and is drawn to a strange woman walking in front of him.\n\nA man becomes fixated on a woman in distress and tries to protect her from a dandy. He reflects on the harsh realities of society and his own isolated nature. He avoids seeing his friend, but eventually decides to visit him. He experiences intense emotions and vivid dreams. He recalls childhood memories and witnesses a group of people mistreating a weak horse. A man tries to stop his friend from harming the horse, but the friend becomes angry and insists on killing it.\n\nA group of men and a fat woman dressed in red cotton and beaded headdress joke and laugh as they load onto a cart pulled by a weak horse. The horse is beaten and eventually killed by its owner, causing outrage and condemnation from onlookers. The owner, Mikolka, is criticized for his actions and the boy who loved the horse is heartbroken and angry. The protagonist, Raskolnikov, overhears a conversation about killing an old woman and it triggers thoughts about his own plan to commit a crime. He is disturbed by the coincidence and it influences his actions later on. The passage also describes a woman named Lizaveta, who is often pregnant and has a kind nature despite her unattractive appearance. A student suggests killing the old woman and using her money for the greater good, arguing that one small crime can be outweighed by thousands of good deeds. Raskolnikov struggles with his thoughts and eventually prepares a noose, feeling feverish and anxious.\n\nA man is unable to sleep and is haunted by daydreams of being in Africa. He prepares for a crime, sewing a noose into his coat and hiding an axe. He has doubts and uncertainties about his plan, but is confident in obtaining the necessary axe. He is surprised to find someone at home and sneaks in to retrieve the axe. He walks calmly to his destination, thinking about the city and its inhabitants. He enters a building and climbs the stairs, feeling anxious. He arrives at the door of an empty flat and listens for the old woman who lived there. He enters her room and gives her a pledge, but becomes frightened and attacks her with an axe. He carefully avoids getting blood on himself and finds valuable items in a chest of drawers. He quickly wraps and pockets the items without inspecting them.\n\nA man named Raskolnikov commits a murder and becomes overwhelmed with fear and guilt. He tries to escape and hide the evidence, but is constantly interrupted and pursued by others. He eventually returns home and hides the stolen items, but is unsure of what to do next. He falls asleep in a state of delirium and wakes up frantically checking for any evidence he may have forgotten.\n\nThe main character, Raskolnikov, is struggling with fear and anxiety as he is summoned to a police station for a debt he owes. He is also dealing with a fever and is worried about being caught for something else. He is eventually scolded by a head clerk and a smart lady for causing a scandal. The group discusses his explosive nature and nickname, and Raskolnikov apologizes for his behavior. He is also dealing with financial struggles and confusion about an IOU.\n\nThe passage follows a conversation between several characters, including Raskolnikov, Nikodim Fomitch, and Ilya Petrovitch. Raskolnikov reveals his struggles with poverty and his past with his landlady's daughter. He experiences a sudden change in perspective and no longer cares about others' opinions. The group discusses a murder case and searches for a missing porter. Raskolnikov becomes ill and tries to confess, but hesitates. He then rushes home to dispose of evidence. The narrator struggles with his actions and decides to visit his friend Razumihin. They discuss a job translating books and the narrator becomes angry and leaves. He then has a confrontation on a bridge.\n\nRaskolnikov visits Razumihin and is almost hit by a carriage on the bridge. He remembers a mysterious emotion from his university days. Later, he becomes ill and experiences fever and delirium. He is taken away and threatened by a stranger. Razumihin takes care of him while he is sick. Raskolnikov's brother and another man visit him and offer him money, but he refuses. Razumihin feeds him and they discuss a woman who Raskolnikov has made mistakes with. A business man named Mr. Tchebarov appears and asks about collecting an IOU. The speaker apologizes for their actions and gives the IOU to the person they were speaking to.\n\nThe speaker reveals that Rodya's mother and sister would do anything to save him, even if it means sacrificing their own well-being. They also warn him about the dangers of being too open and trusting in business. The speaker intervenes in a situation where Rodya's sister gave an IOU to Tchebarov, and now Rodya must pay back the debt. Razumihin apologizes for his previous behavior and introduces Raskolnikov to Zametov. The speaker has become friends with someone and may have said something in delirium. They discuss a parcel and the listener's health. A man tries to improve his friend's appearance by giving him a new cap. The speaker has bought fashionable items for the summer and recommends buying from Fedyaev's. Raskolnikov receives change and his friend assures him of trust. Zossimov enters the room and discusses Raskolnikov's health. Razumihin and Zossimov plan to take a man for a walk and invite Zossimov to a party. The speaker invites the listener to a gathering with various people, including a man named Zametov. Razumihin expresses frustration about bribery and discusses helping a house-painter\n\nThe speaker suspects a man named Nikolay of being involved in a murder due to his suspicious behavior and connection to the victims. The narrator investigates further and discovers evidence that points to Nikolay's guilt. However, the speaker believes that the evidence may have been planted and that there are other facts that prove Nikolay's innocence. The speaker also questions the state of mind of those involved in a recent robbery and believes that the legal system may not accept the accused man's attempted suicide as a psychological impossibility. A man named Pyotr Petrovitch visits Raskolnikov and offers him a place to stay, revealing that he was once his guardian. Pyotr believes that one can learn the most by observing the younger generation and disagrees with the idea that people are \"well shod.\"\n\nThe passage discusses various conversations and events, including a debate on practicality, a murder case, societal issues, and a confrontation between two men. The main character, Raskolnikov, struggles with his thoughts and takes a walk, encountering various people and situations. He also reads about a news story and has a conversation with a detective. The passage ends with Raskolnikov being slapped.\n\nA man named Raskolnikov has a series of encounters with various acquaintances, discussing topics such as recent crimes, his own suspicious behavior, and his possible involvement in a murder. He also struggles with his mental state and contemplates suicide. He eventually returns to his flat, which is being renovated, and observes two people discussing a woman who visits them frequently. The narrator observes changes in a building and overhears conversations about fashion and the city. He visits a building where a murder took place and is followed by suspicious workmen. He witnesses a commotion caused by a carriage and an injured man. He helps bring the man to a wealthy German's house and meets a struggling family. The injured man, Marmeladov, is tended to by Raskolnikov and Katerina Ivanovna. The family's financial struggles are revealed and the injured man's condition worsens. The doctor and priest arrive to help. A man is dying from a horse injury and his family and a priest gather to pray. The man's wife argues with the priest about her husband's death and a young girl named Sonia enters the room. The man recognizes his daughter before dying in her arms. The speaker becomes friends with someone devoted to their family and helps them financially. The protagonist experiences a change and meets with friends. They discuss a secret idea and the protagonist confides in a friend about recent events. His family and friends visit him and he faints upon seeing them.\n\nRaskolnikov's family and friend Razumihin visit him while he is emotionally overwhelmed. He expresses dislike for his sister's suitor and insists they refuse the proposal. Razumihin offers to stay with Raskolnikov and bring a doctor. The group discusses Raskolnikov's condition and his sister's love for him. They wait for the doctor's report and Razumihin becomes angry and attacks the doctor.\n\nA doctor named Zossimov visits a delirious patient and suggests that family may help with their recovery. Zossimov and Razumihin argue about a word and Razumihin reflects on his behavior. The speaker criticizes someone for being lazy and indulgent, and offers to repay them for saving them from a landlady. A man asks his doctor friend to spend time with a woman he is smitten with. The speaker suggests that someone should sit next to a woman and teach her math. The speaker reflects on their current situation and decides not to worry about someone who may be sick. The man remembers his drunken behavior and feels regret. The speaker feels disgusted by the idea of marrying for money. Praskovya Pavlovna refuses to use her late husband's razors and Zossimov is in a hurry to leave her house. Razumihin informs Zossimov that Raskolnikov is sleeping and they discuss his family affairs. The speaker dismisses the idea of taking a man's monomania seriously. The speaker discusses a person with hypochondria and vanity. The narrator arrives at a house and meets two women who are friendly towards him. Pulcheria Alexandrovna invites Razumih\n\nThe speaker is unable to meet the listener at the railway station and has sent someone else instead. They plan to visit the listener at their lodgings the following evening and request that the listener's son not be present. The speaker also wants an explanation from the listener on a certain matter. The listener's family discusses whether or not to allow Rodya to visit and mentions a recent incident involving a drunken man and his daughter. Raskolnikov's family visits him and he is recovering from a physical ailment. A doctor visits Raskolnikov and expresses concern about his lack of progress. Raskolnikov's family is surprised by his strange behavior and wonders if he is only acting out of duty or trying to make amends. Raskolnikov confesses to his mother that he gave away all the money she sent him to a widow and her children in need. His sister, Dounia, disagrees and he becomes sarcastic and bitter towards her. Raskolnikov apologizes to his mother for his behavior and she forgives him. His mother then informs him of the death of Marfa Petrovna Svidrigaïlov. Dounia confronts her brother, Rodya, about their mother's fear\n\nRaskolnikov and his family discuss a man they admire, while Pulcheria Alexandrovna reminisces about a past love. Raskolnikov reflects on his dismal living conditions and apologizes to his sister for his behavior. The siblings argue about their decision to marry someone they don't truly love. Raskolnikov's mother shows him a letter from Pyotr Petrovitch and he expresses surprise at his profession. The group is surprised by a letter written in a legal style. The narrator warns a widow about a man's true intentions. Pulcheria Alexandrovna and Dounia invite Razumihin to dinner. Sonia visits Raskolnikov and invites him to a funeral service. The lodgers are angry about a body left in the heat. Sonia notices Raskolnikov's poor living conditions. Razumihin is invited to dine with the family. Pulcheria Alexandrovna and Dounia discuss their upcoming meeting with a man who may break off their engagement. Raskolnikov interrupts their conversation to speak with Razumihin privately. A mother is concerned about a young woman causing trouble, but her daughter dismisses it. The speaker is worried about their lost items and considers going to the police or a man named Porfiry for help. Raskolnikov introduces his friend Razumihin to Sofya Semyonovna and plans to visit her. A man follows a woman named Sonia and they realize they are neighbors. The speaker is anxious about their upcoming encounter with Porfiry. Raskolnikov and Razumihin meet with Porfiry to discuss business and a murder case. Raskolnikov becomes suspicious when a man winks at him and realizes he knows about his stolen items. The man defends his possession of a silver watch to his friends. Porfiry discusses Raskolnikov's belongings and his recent delirium.\n\nRaskolnikov is confronted by Porfiry and Razumihin about his suspicious behavior and guilt. They discuss the causes of crime and the idea of extraordinary individuals having the right to break moral codes. The conversation also touches on the rarity of genius and independence in society. Raskolnikov is paranoid about being watched by the police and challenges Porfiry to confront him directly. They also discuss an article written by Raskolnikov about the psychology of criminals. The conversation ends with Porfiry expressing interest in reading the article. The speaker expresses anxiety about the mixing of different social classes and the possibility of someone taking advantage of it. They also discuss the idea of punishment for one's actions and the role of conscience. The speaker asks for permission to ask a question and shares a small idea.\n\nThe speaker discusses the idea of criminals being punished and the sadness that often accompanies great men. Raskolnikov is questioned by Porfiry about his article and a recent murder, but denies any involvement. The speaker suspects that someone may be trying to deceive them. Raskolnikov plans to confront Porfiry and Razumihin disagrees with his beliefs. Raskolnikov admits to lying during examinations and becomes uneasy. He is accused of murder by a stranger and reflects on his actions. The narrator struggles with delirium and thoughts of killing. Raskolnikov becomes anxious and follows a man who frightens him.\n\nThe narrator, Raskolnikov, is struggling with delirium and expresses hatred towards an old woman he killed. He also thinks about two gentle women, Lizaveta and Sonia, and wonders why they don't cry. He loses consciousness and finds himself walking in the street at night, surrounded by crowds of people. He then enters a room and kills the old woman with an axe, but she doesn't react and instead laughs silently. He becomes paranoid and tries to escape but is stopped by people in the hallway. Later, he is visited by a man named Svidrigaïlov who reveals his true intentions and discusses the events that led to Marfa Petrovna's death. The narrator also reflects on his actions and the idea that women sometimes enjoy being insulted. Svidrigaïlov also shares his past experiences and reveals that he was given a document and a large sum of money by Marfa Petrovna. The narrator also has a conversation with Marfa Petrovna and later with Arkady Ivanovitch about ghosts. The narrator is seeking revenge for a violent argument with someone who died shortly after.\n\nThe passage discusses the idea of an afterlife and the relationship between Raskolnikov and Svidrigaïlov. Svidrigaïlov offers money to Raskolnikov's sister to end her relationship with Mr. Luzhin. Svidrigaïlov also reveals information about Marfa Petrovna's death and his own past. Raskolnikov's friend Razumihin visits and becomes frustrated with Porfiry and Zametov. The group discusses Svidrigaïlov and his possible involvement in Marfa Petrovna's death. Raskolnikov reveals that Svidrigaïlov recently visited him.\n\nDounia believes Mr. Svidrigaïlov's cruelty led to Philip's suicide, but Luzhin thinks he may have caused Marfa's death. Luzhin wants to help Dounia and her mother, but Pyotr Petrovitch is offended by Dounia's decision to marry him. Luzhin's engagement to Dounia is broken and he holds a grudge against Raskolnikov. The narrator admires Dounia and plans to marry her for her beauty and potential to help him rise in society. Svidrigaïlov offers to help the family, causing suspicion. The family receives a large sum of money and discusses a potential business venture.\n\nA man named Raskolnikov visits Sonia and discusses her family's financial struggles. They also talk about a woman named Lizaveta and her illness. Sonia expresses her love for her family and her plans to open a boarding school. Raskolnikov questions the existence of God, causing Sonia to become upset. They also discuss the possibility of Sonia's family ending up on the streets.\n\nSonia is struggling with her emotions and financial situation. A man becomes emotional and kisses her foot, explaining that he is not bowing down to her but to the suffering of humanity. The man insults the speaker, causing them to question their own suffering. Raskolnikov suggests ending their lives, but Sonia has already considered it. The narrator reflects on Sonia's strength and questions her faith. The narrator becomes intrigued by Sonia's beliefs. Raskolnikov asks Sonia to read the story of Lazarus from the Bible. Sonia struggles to read due to her emotional turmoil. A woman reads a passage from the Bible to a man, who becomes emotional. Sonia reads a passage to Raskolnikov, who remains distant. Raskolnikov is moved by the story of Jesus healing the blind. Mary believes in Jesus after witnessing his miracles. Raskolnikov reveals he has abandoned his family. A man visits a woman and asks her to go on a journey with him. The speaker urges Sonia to join him on a difficult journey. Sonia weeps and asks what can be done for the future of humanity. A man visits Sonia and says goodbye, leaving her worried. Mr. Svidrigaïlov listens to Raskolnikov\n\nThe protagonist, Raskolnikov, is preparing to face his enemy, Porfiry Petrovitch, who is questioning him about a murder. Raskolnikov becomes increasingly uneasy and suspicious of Porfiry's tactics. They discuss the use of legal forms and the importance of understanding a person's temperament. Raskolnikov becomes agitated and confronts Porfiry, but Porfiry shows concern for his well-being. The porter warns Raskolnikov about the consequences of his actions and Porfiry reveals a similar case involving a man with a morbid psychology.\n\nThe speaker is concerned about Raskolnikov's mental state as he obsesses over his suspicions and tries to force the truth out of others. Porfiry Petrovitch tells a story of a man who confessed to murder due to a psychological disorder. Raskolnikov becomes agitated and accuses Porfiry of manipulating him. Porfiry expresses concern for Raskolnikov's well-being and warns him to think of his family. Raskolnikov becomes increasingly agitated and demands to know if he is a suspect in a crime. Porfiry remains calm and suggests calling for evidence. A surprising turn of events occurs when a prisoner confesses to the murder. Raskolnikov and Porfiry discuss the unexpected events and agree to meet again. Raskolnikov worries about the consequences of the confession and reflects on Porfiry's intentions. He decides to attend a memorial dinner and is surprised by a visitor from the previous day. The memory of a previous incident resurfaces in Raskolnikov's mind. A man confesses to Raskolnikov about wronging him and the protagonist worries about being convicted without evidence. Pyotr Petrovitch regrets his actions and plans to seek favor with powerful people. Andrey Semyonovitch is described as self-confident and part of a group that follows popular ideas. Lebeziatnikov and Pyotr Petrovitch have a strained relationship and the latter enjoys belittling the former. The speaker reflects on the idea of equality between men and women and the importance of spreading enlightenment. The writer ends a relationship and expresses regret for not standing up to traditional views. Pyotr Petrovitch asks about the dead man's daughter and the narrator sees her actions as a protest against society. Lebeziatnikov denies accusations and emphasizes the importance of environment in shaping behavior. The speaker is on good terms with Sofya Semyonovna and admires her character.\n\nThe speaker discusses their efforts to create a unique community and their rejection of societal norms. They also mention their development of a woman named Sofya Semyonovna, but deny taking advantage of her. The speaker values usefulness above all else and argues for the freedom of women. They also discuss the importance of self-reliance and breaking free from prejudices. Pyotr Petrovitch and Lebeziatnikov have a dispute over a woman named Sonia, who Pyotr wants to speak to privately. The speaker plans to discuss a matter with the listener in the evening and hopes Mr. Lebeziatnikov will assist them. They also mention the pressure for the poor to honor the deceased in a suitable manner. Katerina Ivanovna, a proud and vain woman, becomes easily agitated and angry due to past failures and misfortunes. She becomes obsessed with maintaining peace and happiness, but is disappointed when her wealthy acquaintances do not attend her dinner party. She invites a woman she previously resented to dinner to show her kindness and nobility.\n\nKaterina Ivanovna invites unexpected guests to a dinner party, including a drunk retired clerk and two unknown Poles. She becomes agitated when her husband's past actions are mentioned and argues with another woman about their social status. The argument escalates until Amalia Ivanovna becomes furious and strikes the table. Pyotr Petrovitch Luzhin arrives and accuses Sofya Ivanovna of stealing a hundred-rouble note. He questions Sonia about the matter and threatens serious consequences if she does not confess. The speaker discusses financial struggles with a listener and Mr. Lebeziatnikov can confirm the situation.\n\nA woman named Sonia is accused of stealing money and is interrogated by Luzhin and Amalia Ivanovna. Katerina Ivanovna defends Sonia and accuses Luzhin of giving her money. Lebeziatnikov accuses Luzhin of planting money on Sonia. Raskolnikov suspects a plot against him and reveals evidence to solve the mystery. Luzhin is uncomfortable and accused by others, while the speaker is evicted from their lodging.\n\nThe protagonist, Katerina Ivanovna, is wronged and overwhelmed with disappointment and helplessness. She seeks justice and leaves her chaotic home with her children and other lodgers. Meanwhile, Raskolnikov defends Sonia against Luzhin and later confesses to her that he knows the truth about the murders. Sonia becomes frightened and embraces Raskolnikov, promising to follow him everywhere. Raskolnikov confesses to Sonia that he killed an old woman for money to support himself through university. Sonia is shocked and distressed by his confession.\n\nThe speaker confesses to killing an old woman for money and justifies it, but his companion Sonia disagrees. He is in a feverish state and reflects on his negative traits and past temptations. He struggles with guilt and regret, but ultimately admits his actions were wrong. He also reflects on wanting to prove his goodness and being led astray by the devil. Sonia urges him to confess and seek redemption, but he is hesitant. The speaker is facing imprisonment and worries about his family. Sonia asks for a cross and they are interrupted by a visitor. Katerina Ivanovna goes mad and causes a scene. The speaker's sister reassures him and he apologizes for his anger. He struggles with his feelings for his sister and another woman. He is in a state of anxiety and bitterness, but is interrupted by someone looking for him. A woman has taken away some children and a man is searching for them. Katerina Ivanovna causes a scene on a bridge.\n\nKaterina Ivanovna, a poor and distressed woman, causes a scene on a bridge with her children. She is eventually taken to her room where she dies, leaving her children in the care of others. Svidrigaïlov, a neighbor of Raskolnikov, offers to help the children and Sonia, and Raskolnikov is constantly thinking about him. After Katerina's death, Raskolnikov meets Svidrigaïlov and they have a conversation about death and fresh air.\n\nSvidrigaïlov discusses his efforts to find suitable institutions for orphans and promises to consult with Raskolnikov. After a church service, Raskolnikov is surprised by Sonia's friendly gesture. A man struggles with guilt and panic attacks, while his friend encourages him to make a decision about his drinking habits. The speaker is determined to uncover a secret and believes it may involve a political conspiracy. Raskolnikov learns about a situation from Porfiry and becomes suspicious of his motives. After a private conversation with Porfiry, Raskolnikov is haunted by their exchange and the implications it holds. Porfiry visits Raskolnikov and they have a serious conversation. The speaker reflects on their past behavior and tries to be more open and honest. Porfiry expresses his sincere desire to not deceive the person he is speaking to. The speaker admits to being the first to suspect the person they are addressing, based on rumors and an accident. They appreciate the youthful energy and sincerity in the person's writing.\n\nThe speaker admits to suspecting the listener and being influenced by rumors and the listener's behavior. They discuss the listener's article and previous conversations, praising their passion and unconventional approach. The speaker reveals evidence against Nikolay and their previous search of the listener's room, but insists they were not being malicious. They purposely spread rumors to provoke a discussion and were impressed by the listener's anger and recklessness. The speaker accuses the listener of being a murderer and recalls their past interactions. They also mention the influence of mood on their perception of the listener's behavior. The speaker urges the listener to confess and find redemption through faith. They also encourage the listener to embrace life and not be afraid of the punishment they will face. The speaker questions the listener's identity and praises their potential. Raskolnikov is warned that he will eventually confess and accept his suffering. The main character goes to see Svidrigaïlov and feels anxious about their future. They are determined to overcome new challenges and question if it is worth the effort.\n\nThe protagonist meets with Svidrigaïlov, unsure of his intentions but drawn to him. He is preoccupied with worries about his future and considers using a secret to gain power. They meet unexpectedly in a tavern and have a tense conversation. Svidrigaïlov shares his biography and defends his indulgence in vice. He reveals a promise he made to his late wife and a woman who tried to save him. The protagonist becomes increasingly irritated as Svidrigaïlov refuses to drop a topic. The speaker discusses their interactions with Avdotya Romanovna and their attempts to manipulate her. They also reflect on past romantic encounters and their current infatuation with a young girl. They discuss Svidrigaïlov's upcoming marriage and his questionable intentions towards the speaker's sister. The speaker also shares their observations of society's corruption and their involvement with a struggling woman and her daughter. They confront Svidrigaïlov about his behavior and offer to help them leave the country. The speaker advises the listener to stop worrying about moral questions in their current situation.\n\nSvidrigaïlov questions Raskolnikov's actions and urges him to explain his theories. Raskolnikov meets with Svidrigaïlov and they discuss money and moral questions. Svidrigaïlov invites Raskolnikov to his room, but he declines. Svidrigaïlov then meets with Dounia and tells her about Raskolnikov's suspicions. Dounia confronts the accuser and they discuss theories about justifying wrongdoing. Svidrigaïlov offers to help Dounia and professes his love for her. He then threatens her family, but she pulls out a revolver. They struggle and Dounia eventually lets him go. The person in the room hands over a key.\n\nSvidrigaïlov helps Dounia reload a misfired gun and confesses his love for her. He later visits low places and meets a woman who refuses his money. He then visits Sonia and advises her to keep quiet about her brother's potential imprisonment. Svidrigaïlov then goes to a hotel and reflects on his actions and thoughts. He has a dream about a girl who committed suicide and decides to go to the park for shelter. He comes across a neglected child and comforts her.\n\nA man finds a neglected child in his room and takes her in, while also struggling with his own thoughts and plans. He encounters a drunk man and a guard before visiting his family and ultimately revealing his crime to his sister. He contemplates suicide but ultimately decides to face the consequences. He justifies his actions and regrets them, but also asks for forgiveness and promises to make a name for himself. The narrator reflects on his struggles and questions the purpose of his suffering. The speaker also questions the purpose of their life and parts ways with a loved one.\n\nA man takes a portrait of his landlady's deceased daughter and gives it to his fiancée. He reflects on his past and questions his current situation. He visits Sonia and reveals his plan to turn himself in for the murder. He is overwhelmed with guilt and remorse. He walks through the streets and encounters various people. He visits Ilya Petrovitch and confesses to the murder.\n\nAfter confessing to his crime, Raskolnikov is sentenced to Siberia and his trial reveals his poverty and mental state as factors in the murder. His mother's illness and death cause concern for his sister Dounia, who eventually marries Razumihin. Raskolnikov's life in prison is described, including his acceptance of his fate and reflections on his actions. He questions society's view of his crime and observes the resilience of his fellow prisoners.\n\nThe narrator reflects on the value of life in prison and the isolation he feels. He observes the admiration for a woman named Sonia among prisoners. A man falls ill and has feverish dreams about a spreading plague causing chaos and violence. The world is in chaos and people turn against each other. Raskolnikov is haunted by a feverish dream and recovers from an illness in prison. His friend Sonia visits him and they reconnect. The narrator is surprised by Sonia's lack of pressure about religion and her unexpected happiness. Life requires effort and suffering, but marks the start of a new journey. There is no information provided to summarize."